{"input_paragraph": ["12.7 years (median age). A typical dachshund is long-bodied and muscular with short stubby legs. It was found that as the inbreeding coefficient increased, litter size decreased and the percentage of stillborn puppies increased, thus indicating inbreeding depression. Retrieved 7 January 2010.", "A Shih Tzu (UK: , US: ; Chinese: 西施犬; pinyin: Xī Shī quǎn literally 'Xi Shi dog', also spelled Shittsu) is a toy dog breed, weighing from 4 to 7.25 kilograms (9–16 lb) when fully grown. The breed was developed in China. It is very common for Shih Tzus to develop eye problems at any age, and even more so once they are older. Most veterinarians will recommend eye drops to assist with any eye irritations. Some dogs have allergies which causes excess discharge around the eye. Some of them have more short, curly hair. This is purely a choice made by the owners. A Shih Tzu should stand no more than 26.7 cm at the withers and with an ideal weight of 4.5 to 7.3 kg.", "A second Akita was arranged to be sent to Miss Keller: Kamikaze's litter brother, Kenzan-go. Kenzan-go died in the mid-1940s. First, while American Akitas are acceptable in all colors, Japanese Akitas are only permitted to be red, white, or brindle. Additionally, American Akitas may be pinto and/or have black masks, unlike Japanese Akitas where it is considered a disqualification and not permitted in the breed standards. American Akitas generally are heavier boned and larger, with a more bear-like head, whereas Japanese Akitas tend to be lighter and more finely featured with a fox-like head. The Akita Inu is one of the most dominant dog breeds. Therefore, training should start in an early age of seven to eight weeks.", "Accepted height ranges may differ depending on country and standard used. Variation can be found within litters, and height (in the range of 40–50 cm or 16–20 in) is above the breed standard in some lines.", "As a breed they are more susceptible to parvovirus than others if not vaccinated, especially as puppies, so vaccination is imperative beginning at 39 days old and continuing every 2 weeks until 4 months old. Then again at 8 months. Once a year after that, as recommend for all breeds.They are very prone to Demodex Mange due to culling for performance. There are two different types of Demodex Mange, namely Localized and Generalized Demodex. Although it is not contagious it is sometimes difficult to treat due to immunodeficiency in some puppies. Statistical evidence published in Global News implicates several other dog breeds had contributed to the rise, stating that 'Toronto's reported dog bites have been rising since 2012, and in 2013 and 2014 reached their highest levels this century, even as pit bulls and similar dogs neared local extinction.' The breed tends to have a higher than average incidence of hip dysplasia.", "Based on 2013 American Kennel Club statistics, Boxers held steady as the seventh-most popular breed of dog in the United States for the fourth consecutive year. However, according to the AKC's website, the boxer is now the eleventh-most popular dog breed in the United States. The head is the most distinctive feature of the Boxer. The breed standard dictates that it must be in perfect proportion to the body and above all it must never be too light. The greatest value is to be placed on the muzzle being of correct form and in absolute proportion to the skull. The length of the muzzle to the whole of the head should be a ratio of 1:3. Folds are always present from the root of the nose running downwards on both sides of the muzzle, and the tip of the nose should lie somewhat higher than the root of the muzzle.", "Classed as a toy dog breed because of its small size, the Pomeranian is descended from larger Spitz-type dogs, specifically the German Spitz. It has been determined by the Fédération Cynologique Internationale to be part of the German Spitz breed; and in many countries, they are known as the Zwergspitz ('Dwarf-Spitz'). They are prone to early tooth loss, and dry food is recommended. Poms are one of the breeds with the smallest average litter size, with various sources giving numbers of between 1.9 and 2.7 puppies per litter.", "Earlier dogs were also more sturdy in build and reportedly capable of covering up to 100 miles in one day. In the UK the Rough Collie is no longer used for serious herding, having been replaced by the Border Collie, though in the United States and a number of European countries, there has been a resurgence in the use of the Collie as a working and performance dog. Canine cyclic neutropenia is a cyclic blood disorder that is usually fatal to affected puppies. The disease is also referred to as 'gray collie syndrome', due to affected puppies having a pale gray, pinkish/gray or beige colouring, none of which are normal Rough Collie colours. Puppies that survive through adulthood are plagued with immune disorders throughout their lives and rarely live more than three years. DNA testing can help detect carriers of the recessive gene that causes the disease.", "Hektor was the product of few generations of selective breeding and completely fulfilled what Von Stephanitz believed a working dog should be. He was pleased with the strength of the dog and was so taken by the animal's intelligence, loyalty and beauty, that he purchased him immediately. German Shepherds are medium to large-sized dogs. The breed standard height at the withers is 60–65 cm (24–26 in) for males, and 55–60 cm (22–24 in) for females. German Shepherds are longer than they are tall, with an ideal proportion of 10 to ​8 1⁄2. The AKC official breed standard does not set a standard weight range. According to a recent survey in the UK, the median life span of German Shepherds is 10.95 years, which is normal for a dog of their size.", "In the U.S./Canada study, 11% of living dogs had arthritis at an average age of 4.3 years. Most other common, non-musculoskeletal morbidity issues strike Berners at rates similar to other breeds. The average life expectancy of a Bernese Mountain Dog is approximately 7 to 8 years. Most other breeds of a similar size have median longevities of 10–11 years. In a 2004 UK survey, the longest-lived of 394 deceased Bernese Mountain Dogs died at the age of 15.2 years. Bernese Mountain Dogs shed year-round, and the heaviest shedding is during seasonal changes. Usually the Bernese will only require a brushing once a week, with more in spring and fall, to keep its coat neat and reduce the amount of fur on the floor and furniture. The Bernese will only require a bath about once every couple of months or so, depending on how high its activity level is and how often it spends its time in the dirt.Special attention should be paid to the ears of the Bernese Mountain Dog, as they can trap bacteria, dirt, and liquid."], "q_to_label": ["Are both the average litter size and life expectancy of this dog breed greater than 7?", "Are both the average litter size and life expectancy of this dog breed greater than 7?", "Are both the average litter size and life expectancy of this dog breed greater than 7?", "Are both the average litter size and life expectancy of this dog breed greater than 7?", "Are both the average litter size and life expectancy of this dog breed greater than 7?", "Are both the average litter size and life expectancy of this dog breed greater than 7?", "Are both the average litter size and life expectancy of this dog breed greater than 7?", "Are both the average litter size and life expectancy of this dog breed greater than 7?", "Are both the average litter size and life expectancy of this dog breed greater than 7?", "Are both the average litter size and life expectancy of this dog breed greater than 7?"], "type_of_question": ["(Yes|No|NA)", "(Yes|No|NA)", "(Yes|No|NA)", "(Yes|No|NA)", "(Yes|No|NA)", "(Yes|No|NA)", "(Yes|No|NA)", "(Yes|No|NA)", "(Yes|No|NA)", "(Yes|No|NA)"], "type_of_question_hint": ["answer Yes/No/NA", "answer Yes/No/NA", "answer Yes/No/NA", "answer Yes/No/NA", "answer Yes/No/NA", "answer Yes/No/NA", "answer Yes/No/NA", "answer Yes/No/NA", "answer Yes/No/NA", "answer Yes/No/NA"], "format_type": ["classification", "classification", "classification", "classification", "classification", "classification", "classification", "classification", "classification", "classification"], "urls": ["https://en.wikipedia.org/wiki/Poodle", "https://en.wikipedia.org/wiki/Lagotto_Romagnolo", "https://en.wikipedia.org/wiki/American_Water_Spaniel", "https://en.wikipedia.org/wiki/English_Water_Spaniel", "https://en.wikipedia.org/wiki/Golden_Retriever", "https://en.wikipedia.org/wiki/German_Shorthaired_Pointer", "https://en.wikipedia.org/wiki/Nova_Scotia_Duck_Tolling_Retriever", "https://en.wikipedia.org/wiki/Weimaraner", "https://en.wikipedia.org/wiki/Portuguese_Water_Dog", "https://en.wikipedia.org/wiki/Chesapeake_Bay_Retriever"], "too_specific_domain": "Does DOG BREED have more than 100 spots?", "domain": "dog breed", "domain_blank": "DOG BREED", "domain_same_answer": "Does DOG BREED have four legs?", "domain_concrete": "Does DOG BREED get taller than 2 feet?", "domain_vague": "Is DOG BREED tall?", "domain_comparison_bad": "which DOG BREED is the biggest?", "domain_too_specific_question": "What colors are Dalmatians?", "domain_too_specific_fix": "Dalmatians with DOG BREED", "domain_same_answer_question": "Does DOG BREED have four legs?", "domain_plural_question": "What DOG BREEDS are from England?", "domain_plural_fix": "Is DOG BREED from England?", "domain_subjective_question": "What is the best DOG BREED?", "domain_comparison_question": "Which DOG BREED is the biggest?", "yes_no_good_question": "Is DOG BREED bigger than 12 inches?", "extraction_good_question": "What height is DOG BREED fully grown?", "domain_easy": "Can DOG BREED be white?", "domain_hard": "Can DOG BREED be more than two colors, including white?"}
