{"input_paragraph": ["* - Facilities close at the end of the business day listed, except campgrounds, which close at 11 am. 1 - Albright Visitor Center closed Thanksgiving Day. 2 - General store closed Thanksgiving Day, Christmas Day, and New Year's Day. 3 - Clinic closed December 31-January 1, May 25, November 25–27, and December 24–25. 4 - 8:30 a.m. to 5:00 p.m. weekdays, excluding holidays. Closed Saturday and Sunday.", "Acadia National Park Visitor Centers. Operating Hours & Seasons - Acadia National Park (U.S. National Park Service) Skip to park information. (207) 288-3338. Rockefeller Welcome Center, Schoodic Institute Photo courtesy of Ryan Reynolds. Used with permission.", "Acadia National Park Visitor Centers. There are no in-person services available for visitors at this time. Need Park Information? Call (207) 288-3338 daily, 8 am to 4 pm, or email us. (207) 288-3338. In response to novel (new) coronavirus (COVID-19), both the Bar Harbor Chamber of Commerce Visitor Center, 2 Cottage St., Bar Harbor, and the Rockefeller Welcome Center at the Schoodic Institute are closed to visitors.", "America's Everglades - The largest subtropical wilderness in the United States. Everglades National Park protects an unparalleled landscape that provides important habitat for numerous rare and endangered species like the manatee,  American crocodile, and the elusive Florida panther.An international treasure as well -  a World Heritage Site, International Biosphere Reserve, a Wetland of International Importance, and a specially protected area under the Cartagena Treaty. Read More.", "Bears are active in Grand Teton. Black and grizzly bears are roaming throughout the park even in most winter months—near roads, trails, and in backcountry areas. Hikers and backcountry users are advised to travel in groups of three or more, make noise, and carry bear spray. Visitors must stay 100 yards from bears. For more information on bears checkout out Safety in Bear Country.", "CLOSED for the season. Following guidance from the CDC and recommendations from state and local public health in consultation with NPS Public Health Service officers, the Carbon River Ranger Station is temporarily closed. More information on the Alerts page. Located on the Carbon River Road 5.5 miles east of the Mowich Lake (SR165) junction. Open year-round. The Carbon River Entrance is open but the road within the park boundary is limited to foot and bicycle traffic. Check the road status webpage or at MountRainierNPS on Twitter prior to coming to the park as road conditions are subject to change (account not required to view). The road is closed to vehicles beyond the entrance. Bicycle and pedestrian traffic is permitted beyond the entrance.", "Current Conditions - Great Smoky Mountains National Park (U.S. National Park Service) LeConte Lodge, Sugarlands Riding Stables, Cades Cove Riding Stables, Cades Cove Campstore, and Smokemont Riding Stables. Smoky Mountain Riding Stables will remain closed. Two webcams provide a current view of the park and information about air quality conditions. Images are updated every 15 minutes.", "IMPORTANT NOTICE TO VISITORS TO EVERGLADES, BISCAYNE and DRY TORTUGAS NATIONAL PARKS, and BIG CYPRESS NATIONAL PRESERVE. HOMESTEAD, KEY WEST AND OCHOPEE, Fla - Due to the lapse in federal appropriations, the National Park Service (NPS) is unable to fully staff the properties under its management. It is not feasible to close or otherwise prohibit all access to NPS properties.", "In order to offer additional protection to wildlife habitat, the following areas have been closed to public entry. -All keys (islands) in Florida Bay are closed to protect bird nesting areas (see exceptions below).", "On March 1, 1872, Yellowstone became the first national park for all to enjoy the unique hydrothermal and geologic wonders. Hot springs are the most abundant hydrothermal feature in Yellowstone, and are home to organisms known as thermophiles. Take a visual journey through photographs of Yellowstone hot springs. Yellowstone Lake, and some of the park entrances. An amazing experience awaits you here. This summer, operations and opportunities will be limited, so please check the current conditions, operating seasons and hours, road conditions, and lodging and eating options to help plan your visit as best as possible."], "q_to_label": ["What are the attractions in this national park and are they ever closed?", "What are the attractions in this national park and are they ever closed?", "What are the attractions in this national park and are they ever closed?", "What are the attractions in this national park and are they ever closed?", "What are the attractions in this national park and are they ever closed?", "What are the attractions in this national park and are they ever closed?", "What are the attractions in this national park and are they ever closed?", "What are the attractions in this national park and are they ever closed?", "What are the attractions in this national park and are they ever closed?", "What are the attractions in this national park and are they ever closed?", "What are the attractions in this national park and are they ever closed?"], "type_of_question": ["(.*?)(.*?,)*", "(.*?)(.*?,)*", "(.*?)(.*?,)*", "(.*?)(.*?,)*", "(.*?)(.*?,)*", "(.*?)(.*?,)*", "(.*?)(.*?,)*", "(.*?)(.*?,)*", "(.*?)(.*?,)*", "(.*?)(.*?,)*"], "type_of_question_hint": ["answer the outputs with commas in between", "answer the outputs with commas in between", "answer the outputs with commas in between", "answer the outputs with commas in between", "answer the outputs with commas in between", "answer the outputs with commas in between", "answer the outputs with commas in between", "answer the outputs with commas in between", "answer the outputs with commas in between", "answer the outputs with commas in between"], "format_type": ["extraction", "extraction", "extraction", "extraction", "extraction", "extraction", "extraction", "extraction", "extraction", "extraction"], "urls": ["https://en.wikipedia.org/wiki/Calvin_Coolidge", "https://en.wikipedia.org/wiki/Ulysses_S._Grant", "https://en.wikipedia.org/wiki/Presidency_of_Barack_Obama", "https://en.wikipedia.org/wiki/Presidency_of_John_F._Kennedy", "https://en.wikipedia.org/wiki/Gerald_Ford", "https://en.wikipedia.org/wiki/Harry_S._Truman", "https://en.wikipedia.org/wiki/James_K._Polk", "https://en.wikipedia.org/wiki/James_Madison", "https://en.wikipedia.org/wiki/George_W._Bush", "https://en.wikipedia.org/wiki/Gerald_Ford"], "structures": ["{\"attractions\": [{\"ever closed\": \"Yes,No\",\"all_values\": true}]}", "{\"attractions\": [{\"ever closed\": \"Yes,No\",\"all_values\": true}]}", "{\"attractions\": [{\"ever closed\": \"Yes,No\",\"all_values\": true}]}", "{\"attractions\": [{\"ever closed\": \"Yes,No\",\"all_values\": true}]}", "{\"attractions\": [{\"ever closed\": \"Yes,No\",\"all_values\": true}]}", "{\"attractions\": [{\"ever closed\": \"Yes,No\",\"all_values\": true}]}", "{\"attractions\": [{\"ever closed\": \"Yes,No\",\"all_values\": true}]}", "{\"attractions\": [{\"ever closed\": \"Yes,No\",\"all_values\": true}]}", "{\"attractions\": [{\"ever closed\": \"Yes,No\",\"all_values\": true}]}", "{\"attractions\": [{\"ever closed\": \"Yes,No\",\"all_values\": true}]}", "{\"attractions\": [{\"ever closed\": \"Yes,No\",\"all_values\": true}]}", "{\"attractions\": [{\"ever closed\": \"Yes,No\",\"all_values\": true}]}"], "too_specific_domain": "How often does Old Faithful fire?", "domain": "national park", "domain_blank": "NATIONAL PARK", "domain_same_answer": "Does NATIONAL PARK have a fee to get in?", "domain_concrete": "Does NATIONAL PARK have a rain forest?", "domain_vague": "Does it rain a lot in NATIONAL PARK?", "domain_comparison_bad": "which NATIONAL PARK is the biggest?", "domain_too_specific_question": "What state is Acadia National Park in?", "domain_too_specific_fix": "Acadia National Park with NATIONAL PARK", "domain_same_answer_question": "What country is NATIONAL PARK in?", "domain_plural_question": "What NATIONAL PARKS are in California?", "domain_plural_fix": "Is NATIONAL PARK in California?", "domain_subjective_question": "When is the best time of year to visit NATIONAL PARK?", "domain_comparison_question": "Which NATIONAL PARK is the biggest?", "domain_comparison_fix": "Is NATIONAL PARK bigger than 100km?", "domain_easy": "Can you hike in NATIONAL PARK?", "domain_hard": "Can you hike <strong>to a waterfall</strong> in NATIONAL PARK?", "yes_no_good_question": "Are there hiking trails to NATIONAL PARK?", "extraction_good_question": "What hiking trails are there at NATIONAL PARK?"}