{"input_paragraph": ["A popular companion dog, the Yorkshire Terrier has also been part of the development of other breeds, such as the Silky Terrier. The Paisley Terrier, a smaller version of the Skye Terrier that was bred for a beautiful long silky coat, also figured into the early dogs. Some authorities believed that the Maltese was used as well. 'They were all originally bred from Scotch Terriers (meaning dogs from Scotland, not today's Scottish Terrier) and shown as such [...] the name Yorkshire Terrier was given to them on account of their being improved so much in Yorkshire.' Yorkshire Terriers were shown in a dog show category (class) at the time called 'Rough and Broken-coated, Broken-haired Scotch and Yorkshire Terriers'.", "Barbets are vulnerable to certain genetic defects. Due to the limited gene pool for this breed, conscientious breeders carefully study pedigrees and select dogs to minimize the chance of genetic diseases. Unfortunately, like many breeds, a growing popularity has encouraged breeding by people who are not knowledgeable about the breed. Of the few health issues that have exhibited themselves; epilepsy, hernias, hip dysplasia and entropion, most problems can be traced back 4–6 generations. Often this was due to limited breeding stock as well as the fact that many matings were with dogs of unknown medical history.", "Cavaliers are also affected by ear problems, a common health problem among spaniels of various types, and they can have such other general conditions as hip dysplasia, which are common across many types of dog breeds.", "In the 17th and 18th century, the Old English Bulldog had many different strains for cattle-droving, bull-baiting, farm dogs, and butcher's dogs. Bull-baiting was also a common blood sport of the era and though there is evidence of such migrating to America with the landrace bulldogs brought by working class Englishmen in colonial times, it is also certain that the strains that migrated to America were unaffected by the banning of the sport in 1835 in the U.K. and, therefore, there was no need for a decline in the population of the old-type bulldog. In this facet its temperament is similar to other longer established and better-known utility breeds used for livestock guarding, like the Rottweiler, itself a German type of 'bulldog'; another name for the breed being 'Rottweiler Metzgerhund,' or 'butcher's dog from Rottweil'. 4 Health. Caninegeneticdiseases.net. Caninegeneticdiseases.net.", "Initially one of the highland breeds of terrier that were grouped under the name of Skye Terrier, it is one of five breeds of terrier that originated in Scotland, the other four being the modern Skye, Cairn, Dandie Dinmont, and West Highland White Terriers. Two genetic health concerns seen in the breed are von Willebrand disease (vWD) and craniomandibular osteopathy (CMO); Scottie cramp, patellar luxation and cerebellar abiotrophy are also sometimes seen in this breed. Common eye conditions seen in a variety of breeds such as cataracts and glaucoma can appear in Scotties as they age. Two genetic health concerns seen in the breed are von Willebrand disease (vWD) and craniomandibular osteopathy (CMO); Scottie cramp, patellar luxation and cerebellar abiotrophy are also sometimes seen in this breed. Common eye conditions seen in a variety of breeds such as cataracts and glaucoma can appear in Scotties as they age. There are no specific conditions relating the skin that affect the breed, but they can be affected by common dog related conditions such as parasites and mange.", "It is a popular pet due to its size, good temper, and a lack of inherited health problems. From medieval times, beagle was used as a generic description for the smaller hounds, though these dogs differed considerably from the modern breed. The larger hounds would run the prey to ground, then the hunters would release the small dogs to continue the chase through underbrush. Elizabeth I referred to the dogs as her singing beagles and often entertained guests at her royal table by letting her Pocket Beagles cavort amid their plates and cups. 19th-century sources refer to these breeds interchangeably and it is possible that the two names refer to the same small variety. Beagles are considered a chondrodystrophic breed, meaning that they are prone to types of disk diseases.", "Jack Russells are an energetic breed that rely on a high level of exercise and stimulation. They are relatively free from any serious health complaints. They are relatively free from any serious health complaints. Originating from dogs bred and used by the Reverend John Russell in the early 19th century, from whom the breed takes its name, the Jack Russell has similar origins to the modern Fox terrier. It has gone through several changes over the years, corresponding to different use and breed standards set by kennel clubs. The Jack Russell terrier and Parson Russell Terrier breeds are similar, sharing a common origin, but have several marked differences — the most notable being the range of acceptable heights. Other differences in the Parson can include a longer head and larger chest as well as overall a larger body size.", "The Basenji is a breed of hunting dog. It was bred from stock that originated in central Africa. Most of the major kennel clubs in the English-speaking world place the breed in the hound group—more specifically, in the sighthound type. Most of the major kennel clubs in the English-speaking world place the breed in the hound group—more specifically, in the sighthound type. The Fédération Cynologique Internationale places the breed in its group five (spitz and primitive types), and the United Kennel Club (US) places the breed in its Sighthound and pariah group. Basenjis share many unique traits with pariah dog types. The name comes from the Lingala language of the Congo, mbwá na basɛ́nzi which means 'villager dogs'. The name comes from the Lingala language of the Congo, mbwá na basɛ́nzi which means 'villager dogs'. Several attempts were made to bring the breed to England, but the earliest imports succumbed to disease.", "The Cairn Terrier is one of the oldest terrier breeds, originating in the Scottish Highlands and recognized as one of Scotland's earliest working dogs. The breed was given the name Cairn because the breed's function was to hunt and chase quarry between the cairns in the Scottish highlands. Some of the more common hereditary health problems found in the Cairn are:", "The Dutch Shepherd is a herding dog of Dutch origin. They were used by shepherds and farmers who needed a versatile dog, with few demands, and a dog that was able to adapt to a harsh and meager existence. They also accompanied the flocks on their way to the common meadows, markets, and ports. The Dutch Breed Club initiated a hotline in 2008 for reporting health and behavioral problems. Most genetic health problems occur at a low rate in this breed. The Dutch Breed Club initiated a hotline in 2008 for reporting health and behavioral problems. Most genetic health problems occur at a low rate in this breed. The Dutch Shepherd Dog Club of America financed genetic research to analyze and interpret molecular information to identify this disease, which was spearheaded by Dutch Shepherd Dog Club of America veterinary counsel Karen Wroblewski DVM."], "q_to_label": ["What are the medical names for common diseases of this dog breed?", "What are the medical names for common diseases of this dog breed?", "What are the medical names for common diseases of this dog breed?", "What are the medical names for common diseases of this dog breed?", "What are the medical names for common diseases of this dog breed?", "What are the medical names for common diseases of this dog breed?", "What are the medical names for common diseases of this dog breed?", "What are the medical names for common diseases of this dog breed?", "What are the medical names for common diseases of this dog breed?", "What are the medical names for common diseases of this dog breed?"], "type_of_question": ["(.*?)(.*?,)*", "(.*?)(.*?,)*", "(.*?)(.*?,)*", "(.*?)(.*?,)*", "(.*?)(.*?,)*", "(.*?)(.*?,)*", "(.*?)(.*?,)*", "(.*?)(.*?,)*", "(.*?)(.*?,)*", "(.*?)(.*?,)*"], "type_of_question_hint": ["answer the outputs with commas in between", "answer the outputs with commas in between", "answer the outputs with commas in between", "answer the outputs with commas in between", "answer the outputs with commas in between", "answer the outputs with commas in between", "answer the outputs with commas in between", "answer the outputs with commas in between", "answer the outputs with commas in between", "answer the outputs with commas in between"], "format_type": ["extraction", "extraction", "extraction", "extraction", "extraction", "extraction", "extraction", "extraction", "extraction", "extraction"], "urls": ["https://en.wikipedia.org/wiki/Cavalier_King_Charles_Spaniel", "https://en.wikipedia.org/wiki/Yorkshire_Terrier", "https://en.wikipedia.org/wiki/Portuguese_Water_Dog", "https://en.wikipedia.org/wiki/Miniature_Bull_Terrier", "https://en.wikipedia.org/wiki/Border_Collie", "https://en.wikipedia.org/wiki/Bernese_Mountain_Dog", "https://en.wikipedia.org/wiki/Shar_Pei", "https://en.wikipedia.org/wiki/Pug", "https://en.wikipedia.org/wiki/Chinese_Crested_Dog", "https://en.wikipedia.org/wiki/Leonberger"], "too_specific_domain": "Does DOG BREED have more than 100 spots?", "domain": "dog breed", "domain_blank": "DOG BREED", "domain_same_answer": "Does DOG BREED have four legs?", "domain_concrete": "Does DOG BREED get taller than 2 feet?", "domain_vague": "Is DOG BREED tall?", "domain_comparison_bad": "which DOG BREED is the biggest?", "domain_too_specific_question": "What colors are Dalmatians?", "domain_too_specific_fix": "Dalmatians with DOG BREED", "domain_same_answer_question": "Does DOG BREED have four legs?", "domain_plural_question": "What DOG BREEDS are from England?", "domain_plural_fix": "Is DOG BREED from England?", "domain_subjective_question": "What is the best DOG BREED?", "domain_comparison_question": "Which DOG BREED is the biggest?", "yes_no_good_question": "Is DOG BREED bigger than 12 inches?", "extraction_good_question": "What height is DOG BREED fully grown?", "domain_easy": "Can DOG BREED be white?", "domain_hard": "Can DOG BREED be more than two colors, including white?"}